package com.sanda;

import edu.emory.mathcs.backport.java.util.Collections;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

/**
 * Created by Asus on 4/22/2018.
 */
public class ExcelColumnIndexer {

    public static void main(String[] args) {
        String[] ar = {"плоскоклеточный",
                "аденокарцинома",
                "крупноклеточный",
                "недифференцированный",
                "мелкоклеточный",
                "лейомиосаркома",
                "стромальная саркома матки",
                "аденокарцинома прямой кишки",
                "светлоклеточный",
                "пневмосклероз",
                "карциноид",
                "раковые клетки",
                "туберкулома",
                "меланома",
                "плоскоклеточный пищевода",
                "туберкулёз",
                "пневмония",
                "гамартома",
                "бронхит",
                "лимфома Т-клеточная",
                "другой",
                "почечно-клеточный рак",
                "железисто-плоскоклеточный",
                "лимфома",
                "нейроэндокринный"};
        List list = Arrays.asList(ar);
        String in = "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "крупноклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "недифференцированный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "переходно-клеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "мелкоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома прямой кишки\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "лейомиосаркома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "мелкоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "мелкоклеточный\n" +
                "мелкоклеточный\n" +
                "аденокарцинома\n" +
                "мелкоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "мелкоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "железисто-плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "недифференцированный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "стромальная саркома матки\n" +
                "плоскоклеточный\n" +
                "нет\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "светлоклеточный\n" +
                "плоскоклеточный\n" +
                "пневмосклероз\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "карциноид\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "карциноид\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "раковые клетки\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "раковые клетки\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "туберкулома\n" +
                "меланома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный пищевода\n" +
                "плоскоклеточный\n" +
                "карциноид\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "мелкоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "мелкоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "мелкоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "карциноид\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "туберкулома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "туберкулома\n" +
                "туберкулома\n" +
                "туберкулёз\n" +
                "пневмония\n" +
                "аденокарцинома\n" +
                "гамартома\n" +
                "\n" +
                "бронхит\n" +
                "лимфома Т-клеточная\n" +
                "другой\n" +
                "пневмония\n" +
                "почечно-клеточный рак\n" +
                "туберкулёз\n" +
                "гамартома\n" +
                "гамартома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "железисто-плоскоклеточный\n" +
                "гамартома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "пневмония\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                " лимфома T-клеточная\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "крупноклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "лимфома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "карциноид\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "мелкоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "мелкоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "недифференцированный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "карциноид\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "крупноклеточный\n" +
                "\n" +
                "аденокарцинома\n" +
                "\n" +
                "аденокарцинома\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "\n" +
                "мелкоклеточный\n" +
                "\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "\n" +
                "нейроэндокринный\n" +
                "нейроэндокринный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n" +
                "крупноклеточный\n" +
                "плоскоклеточный\n" +
                "плоскоклеточный\n" +
                "аденокарцинома\n";
        String[] parts = in.split("\n");
        int index = 1;
        for (int i=0; i<parts.length; i++) {
            if (list.contains(parts[i])) {
                parts[i] = (index + i) + " - " + parts[i];
                System.out.println(parts[i]);
            }
        }
    }
}
